Repository: asyncwhale/raccoon
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# %lld / %lld sessions
source: %1$lld / %2$lld sessions
zh_hans: %1$lld / %2$lld 个会话

source: %lld sessions
zh_hans: %lld 个会话

# content.block.copy.help
source: Copy this block
zh_hans: 复制这一段

# content.toast.copied
source: Copied
zh_hans: 已复制

# contentview.pin.off.help
source: Unpin (restore normal window level)
zh_hans: 取消置顶（恢复普通窗口层级）

# contentview.pin.on.help
source: Pin window (float above full-screen apps)
zh_hans: 置顶窗口（浮在全屏应用之上）

# contentview.sidebar.help
source: Show/hide session list (⌘\)
zh_hans: 显示/隐藏会话列表 (⌘\)

# contentview.sync.help
source: Sync now — scan terminal AI tools for new sessions
zh_hans: 立即同步 — 扫描终端 AI 工具的新会话

# editor.autoclean.off.help
source: Auto-clean on paste (off) — click to enable; cleans automatically on ⌘V
zh_hans: 自动清洗粘贴内容（已关闭）— 点击开启，⌘V 时自动清洗

# editor.autoclean.on.help
source: Auto-clean on paste (on) — strips ANSI/watermarks on ⌘V, never breaks code, one-click restore
zh_hans: 自动清洗粘贴内容（已开启）— ⌘V 时去除 ANSI/水印，代码不会被破坏，可一键还原原文

# editor.banner.archived
source: ARCHIVED · READ-ONLY
zh_hans: 归档 · 只读

# editor.convert.help
source: Convert the selection (or whole note) to plain text — strips Markdown (undoable)
zh_hans: 将选中内容（或整篇笔记）转为纯文本 — 去除 Markdown（可撤销）

# editor.empty.subline.none
source: Press ⌘N for a new note, or pick a session.
zh_hans: 按 ⌘N 新建笔记，或选择一段会话。

# editor.empty.subline.note
source: Paste terminal output to auto-clean it, or pick an archived session on the left.
zh_hans: 粘贴终端输出即可自动清洗，或从左侧选择一段归档会话。

# editor.empty.title
source: A clean page.
zh_hans: 一张干净的页面。

# editor.error.open.title
source: Open failed
zh_hans: 打开失败

# editor.error.save.title
source: Save failed
zh_hans: 保存失败

# editor.feed.content
source: Feed · Content
zh_hans: 喂·内容

# editor.feed.content.caption
source: for a web AI
zh_hans: 给网页 AI

# editor.feed.content.help
source: Copy the verbatim content with “who said it” labels; paste it to a web AI
zh_hans: 复制带「谁说的」来源标签的逐字内容，粘给网页 AI

# editor.feed.copy
source: Copy
zh_hans: 复制走

# editor.feed.copy.help
source: Copy this record’s plain text (without speaker labels)
zh_hans: 复制本条记录的纯文本到剪贴板（不含 你:/Codex: 等来源标签）

# editor.feed.path
source: Feed · Path
zh_hans: 喂·路径

# editor.feed.path.caption
source: for a CLI agent
zh_hans: 给命令行 AI

# editor.feed.path.help
source: Copy this archive’s .md path; paste it to a CLI AI so it can read the file itself
zh_hans: 复制这条归档的 .md 文件路径，粘给 CLI 里的 AI 让它自己读

# editor.newNote.help
source: New note (⌘N)
zh_hans: 新建笔记 (⌘N)

# editor.preview.back.help
source: Back to editing
zh_hans: 返回编辑

# editor.preview.show.help
source: Preview Markdown
zh_hans: 预览 Markdown

# editor.record.back.help
source: Back to editor (close this archived record)
zh_hans: 返回编辑器（关闭这条归档记录）

# editor.restorePaste.help
source: Restore this paste to its original text (undoable)
zh_hans: 还原本次粘贴为原始文本（可撤销）

# editor.save.help
source: Save to the notes folder (⌘S)
zh_hans: 保存到笔记文件夹 (⌘S)

# editor.star.off.help
source: Star — protect this record, never deleted
zh_hans: 加星 — 保护此记录，永不删除

# editor.star.on.help
source: Starred — never auto-purged (click to unstar)
zh_hans: 已加星 — 永不被自动清理删除（点击取消）

# editor.tab.close.help
source: Close tab
zh_hans: 关闭标签页

# editor.tab.readonly.help
source: Read-only archived record
zh_hans: 只读归档记录

# editor.untitled
source: Untitled
zh_hans: 未命名

# editor.untitledNote.filename
source: Untitled Note
zh_hans: 未命名笔记

# menu.cleanContent
source: Clean to Plain Text
zh_hans: 清洗为纯文本

# menu.findInArchive
source: Find in Archive
zh_hans: 在归档中查找

# menu.newNote
source: New Note
zh_hans: 新建笔记

# menu.togglePin
source: Toggle Pin Window
zh_hans: 切换窗口置顶

# menu.togglePreview
source: Toggle Preview
zh_hans: 切换预览

# menu.toggleSidebar
source: Toggle Sidebar
zh_hans: 切换边栏

# menubar.quit
source: Quit Raccoon
zh_hans: 退出 Raccoon

# menubar.settings
source: Settings…
zh_hans: 设置…

# menubar.showWindow
source: Show window
zh_hans: 显示窗口

# menubar.syncNow
source: Sync now
zh_hans: 立即同步

# model.error.cleanupFailed %@
source: Cleanup failed: %@
zh_hans: 清理失败：%@

# model.error.indexOpen %@
source: Couldn’t open the search index: %@
zh_hans: 无法打开搜索索引：%@

# model.error.openRecord %@
source: Couldn’t open record: %@
zh_hans: 无法打开记录：%@

# model.error.starFailed %@
source: Star update failed: %@
zh_hans: 星标更新失败：%@

# model.error.syncFailed %@
source: Sync failed: %@
zh_hans: 同步失败：%@

# model.error.trashFailed %@
source: Move to Trash failed: %@
zh_hans: 移到废纸篓失败：%@

# model.error.untrashFailed
source: Restore failed: %@
zh_hans: 恢复失败：%@

# onboarding.pillar.clean.detail
source: Paste terminal output and the noise is stripped automatically, never breaking code (restorable).
zh_hans: 粘贴终端输出，自动去除噪声，绝不破坏代码（可还原）。

# onboarding.pillar.clean.title
source: Clean
zh_hans: 清洗

# onboarding.pillar.feed.detail
source: Hand records back to AI — Copy / Feed · Path (for CLI AI to read itself) / Feed · Content (for web AI).
zh_hans: 把记录交回给 AI —— 复制走 / 喂·路径（给命令行 AI 自己读）/ 喂·内容（给网页 AI）。

# onboarding.pillar.feed.title
source: Feed
zh_hans: 投喂

# onboarding.pillar.record.detail
source: Auto-archive your Claude Code / Codex / Gemini / Cursor sessions, cleaned into tidy Markdown (read-only source logs, never modified).
zh_hans: 自动归档 Claude Code / Codex / Gemini / Cursor 的会话，洗成干净的 Markdown（只读源日志，绝不改动）。

# onboarding.pillar.record.title
source: Record
zh_hans: 记录

# onboarding.pillar.search.detail
source: Full-text search across every past session, across tools.
zh_hans: 跨工具全文检索所有历史会话。

# onboarding.pillar.search.title
source: Search
zh_hans: 搜索

# onboarding.start
source: Get Started
zh_hans: 开始使用

# onboarding.subtitle
source: Your local memory layer for terminal AI sessions — Record · Clean · Search · Feed
zh_hans: 你的终端 AI 会话本地记忆层 —— 记 · 洗 · 找 · 喂

# onboarding.title
source: Welcome to Raccoon
zh_hans: 欢迎使用 Raccoon

# onboarding.trust
source: 100% local · zero network · free & open source
zh_hans: 100% 本地 · 零联网 · 免费开源

# settings.behavior.autoclean
source: Auto-clean on paste
zh_hans: 粘贴时自动清洗

# settings.behavior.autoclean.footer
source: When on, text pasted into the editor is scrubbed of ANSI/watermarks and reflowed by CleanEngine — and any paste is one-click restorable.
zh_hans: 开启后，粘贴进编辑器的文本会被 CleanEngine 去除 ANSI/水印并重排版 —— 任何一次粘贴都可一键还原。

# settings.behavior.menubar
source: Menu bar mode (hide Dock icon)
zh_hans: 菜单栏模式（隐藏 Dock 图标）

# settings.behavior.menubar.footer
source: When on, Raccoon runs as a menu-bar resident app with no Dock icon; a pinned window floats more reliably above other apps’ full screen. Summon the window from the menu-bar icon or the global shortcut.
zh_hans: 开启后 Raccoon 作为菜单栏常驻应用运行，没有 Dock 图标；置顶窗口能更可靠地浮在其它应用全屏之上。从菜单栏图标或全局快捷键唤出窗口。

# settings.behavior.tidyprose
source: Tidy body indentation and blank lines (on paste)
zh_hans: 整理正文缩进与空行（粘贴时）

# settings.behavior.tidyprose.footer
source: Removes leading spaces and merges extra blank lines; leaves code and tables untouched
zh_hans: 去除段首多余空格、合并多余空行；不影响代码与表格

# settings.dir.choose
source: Choose…
zh_hans: 选择…

# settings.dir.choose.prompt
source: Choose
zh_hans: 选择

# settings.dir.notes
source: Notes folder
zh_hans: 笔记文件夹

# settings.dir.records
source: Records folder
zh_hans: 记录文件夹

# settings.dir.records.footer
source: Changing the records folder takes effect after the next launch (this version does not live-migrate the open archive).
zh_hans: 更改记录文件夹会在下次启动后生效（此版本不会实时迁移已打开的归档）。

# settings.retention.30days
source: 30 days
zh_hans: 30 天

# settings.retention.7days
source: 7 days
zh_hans: 7 天

# settings.retention.choice
source: Auto-recycle when expired
zh_hans: 过期后自动回收

# settings.retention.custom
source: Custom
zh_hans: 自定义

# settings.retention.footer
source: Unstarred records past the retention window are moved to Trash by the daily cleanup, then purged after a 7-day grace period. “Forever” never cleans.
zh_hans: 超过保留期的未加星记录会在每日清理时移到废纸篓，再经过 7 天宽限期后彻底删除。“永久”从不清理。

# settings.retention.forever
source: Forever
zh_hans: 永久

# settings.retention.keepDays %lld
source: Keep %lld days
zh_hans: 保留 %lld 天

# settings.section.behavior
source: Behavior
zh_hans: 行为

# settings.section.directories
source: Directories
zh_hans: 文件夹

# settings.section.retention
source: Retention
zh_hans: 保留期

# settings.section.shortcut
source: Global Shortcut
zh_hans: 全局快捷键

# settings.section.tools
source: Enabled Tools
zh_hans: 启用的工具

# settings.shortcut.footer
source: Set a global hotkey to bring the Raccoon main window to the front from any app.
zh_hans: 设置一个全局快捷键，从任意应用把 Raccoon 主窗口带到前台。

# settings.shortcut.recorder
source: Summon Raccoon:
zh_hans: 唤出 Raccoon：

# settings.tools.footer
source: Enabled tools are scanned on the next sync.
zh_hans: 启用的工具会在下次同步时被扫描。

# settings.tools.soon
source: Soon
zh_hans: 即将

# sidebar.empty.filtered.headline
source: No matching sessions
zh_hans: 没有匹配的会话

# sidebar.empty.filtered.subline
source: No sessions match the current filter. Tap a chip again to clear it.
zh_hans: 没有会话符合当前筛选。再次点击对应标签即可清除。

# sidebar.empty.nomatch.headline
source: No matches
zh_hans: 没有匹配

# sidebar.empty.nomatch.subline %@
source: Nothing in the archive matches “%@”.
zh_hans: 归档里没有匹配“%@”的内容。

# sidebar.empty.none.headline
source: No sessions yet
zh_hans: 还没有会话

# sidebar.empty.none.hint
source: ⌘R to sync
zh_hans: ⌘R 同步

# sidebar.empty.none.subline
source: Run a Claude Code / Codex session and its archive appears here automatically.
zh_hans: 运行一次 Claude Code / Codex 会话，归档会自动出现在这里。

# sidebar.empty.syncing.headline
source: Syncing…
zh_hans: 同步中…

# sidebar.empty.syncing.subline
source: Scanning your terminal AI tools.
zh_hans: 正在扫描你的终端 AI 工具。

# sidebar.filter.starred
source: Starred
zh_hans: 加星

# sidebar.filter.starred.a11y
source: Show starred only
zh_hans: 只看加星

# sidebar.filter.tool.a11y %@
source: Filter by %@
zh_hans: 按 %@ 筛选

# sidebar.row.star.help
source: Star — protect this record, never deleted
zh_hans: 加星 — 保护此记录，永不删除

# sidebar.row.unstar.help
source: Starred — click to unstar
zh_hans: 已加星 — 点击取消

# sidebar.search.clear.help
source: Clear search
zh_hans: 清除搜索

# sidebar.search.prompt
source: Search archive…
zh_hans: 搜索归档…

# sidebar.section.archive
source: Archive
zh_hans: 归档

# sidebar.section.searchResults
source: Search Results
zh_hans: 搜索结果

# sidebar.trash.restored
source: Restored
zh_hans: 已恢复

# sidebar.trash.toast
source: Moved to Trash
zh_hans: 已移到废纸篓

# sidebar.trash.undo
source: Undo
zh_hans: 撤销

# toast.converted
source: Converted to plain text
zh_hans: 已转为纯文本

# toast.copied.clipboard
source: Copied to clipboard
zh_hans: 已复制到剪贴板

# toast.copied.content
source: Copied content with speaker labels
zh_hans: 已复制带来源标签的内容

# toast.copied.path
source: Copied .md path
zh_hans: 已复制 .md 路径

# toast.copied.secrets %lld
source: Copied ⚠️ %lld possible secret(s)
zh_hans: 已复制 ⚠️ 含疑似密钥 %lld 处

# toast.restoredPaste
source: Restored this paste
zh_hans: 已还原本次粘贴

# toast.star.off
source: Star removed
zh_hans: 已取消星标

# toast.star.on
source: Starred — never deleted
zh_hans: 已加星 — 永不删除

# trash.cancel
source: Cancel
zh_hans: 取消

# trash.confirm.message
source: Recoverable from Finder’s _trash folder for 7 days.
zh_hans: 7 天内可在访达的 _trash 文件夹里恢复。

# trash.confirm.title
source: Move to Trash?
zh_hans: 移到废纸篓？

# trash.move
source: Move to Trash
zh_hans: 移到废纸篓
